app/views/decisions/show.html.erb

SELECT "choices".* FROM "choices" WHERE "choices"."decision_id" = ?  [["decision_id", 38]]
---
          <div id="hidden_inputs">
            <% @decision.choices.each do |choice| %>