app/controllers/choices_controller.rb

  def create
    @choice = current_decision.choices.build(choice_params)
    if @choice.save
---
INSERT INTO "choices" ("name", "decision_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ASDfsdfsdfs"], ["decision_id", 11], ["created_at", "2015-12-14 15:37:31.854868"], ["updated_at", "2015-12-14 15:37:31.854868"]]