app/controllers/criteriums_controller.rb

  def new
    @criterium = Choice.find(params[:choice_id]).criteriums.build
---
SELECT  "choices".* FROM "choices" WHERE "choices"."id" = ? LIMIT 1  [["id", 7]]