app/controllers/decisions_controller.rb

  def index
    @decisions = Decision.where('best_abs_id IS NOT NULL').limit(5).order('created_at desc')
---
SELECT  "decisions".* FROM "decisions" WHERE (best_abs_id IS NOT NULL)  ORDER BY created_at desc LIMIT 5

  def show
    @decision = Decision.find(params[:id])
---
SELECT  "decisions".* FROM "decisions" WHERE "decisions"."id" = ? LIMIT 1  [["id", 22]]

  def create
    @decision = Decision.new(decision_params)
    if @decision.save
---
INSERT INTO "decisions" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "My first rough decision. What to write here?"], ["created_at", "2015-12-14 14:40:40.916650"], ["updated_at", "2015-12-14 14:40:40.916650"]]